{
  "metadata": {
    "source": "Qualifizierungsmodule_Qualifizierungspläne_v4_enUS.xlsx",
    "sheet": "Learning Objectives",
    "range": "D16:G31",
    "description": "Standard learning objectives for 16 SE competencies at 4 competency levels",
    "scale": "1=know, 2=understand, 4=apply, 6=master",
    "note": "This matches the role_competency_matrix scale: 0=not relevant, 1=know, 2=understand, 3/4=apply, 6=master"
  },
  "competencies": {
    "1": {
      "competency_name": "Systemic thinking",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "The participant knows the interrelationships of their system and the associated system boundaries. "
        },
        "2": {
          "level_name": "Understand",
          "objective": "The participant understands the interaction of the individual components that make up the system. "
        },
        "4": {
          "level_name": "Apply",
          "objective": "The participant is able to analyze his existing system and derive continuous improvements from it. "
        },
        "6": {
          "level_name": "Master",
          "objective": "The participant is able to bring systems thinking into the company and inspire others to do the same. "
        }
      }
    },
    "2": {
      "competency_name": "System modeling and analysis",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "Participants know the basis of modeling and its benefits."
        },
        "2": {
          "level_name": "Understand",
          "objective": "Participants understand how models support their work. They are able to read models easily."
        },
        "4": {
          "level_name": "Apply",
          "objective": "Participants are able to independently define their own system models for their relevant scope. They are able to distinguish between cross-domain and domain-specific models,"
        },
        "6": {
          "level_name": "Master",
          "objective": "Participants can set guidelines for (necessary) models and write guidelines for good modeling."
        }
      }
    },
    "3": {
      "competency_name": "Consideration of system life cycle phases",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "Participants know the life cycle phases of their system"
        },
        "2": {
          "level_name": "Understand",
          "objective": "The participant understands why and how all life cycle phases must be considered in the context of development."
        },
        "4": {
          "level_name": "Apply",
          "objective": "The participant is able to identify, consider and evaluate all life cycle phases for the scopes relevant to him/her "
        },
        "6": {
          "level_name": "Master",
          "objective": "The participant is able to evaluate concepts with regard to the consideration of all life cycle phases."
        }
      }
    },
    "4": {
      "competency_name": "Customer benefit orientation",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "The participant recognizes the basic principles of agile thinking."
        },
        "2": {
          "level_name": "Understand",
          "objective": "The participant understands how agile thinking can be integrated into everyday working life"
        },
        "4": {
          "level_name": "Apply",
          "objective": "The participant is able to develop a system according to agile thinking and to put the customer benefit in the center of attention."
        },
        "6": {
          "level_name": "Master",
          "objective": "The participant is able to bring agile thinking into the company and inspire others to do the same. "
        }
      }
    },
    "5": {
      "competency_name": "Requirements management",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "Process: Participants can differentiate between requirements, stakeholder requirements, system requirements and system element requirements. They know the importance of traceability and understand why tools are necessary for this,Method: The participants know the basic process of requirements management. This includes identifying, formulating, deriving and analyzing requirementsTool: The participants know that there is a tool for requirements management."
        },
        "2": {
          "level_name": "Understand",
          "objective": "Process: Participants understand how requirements sources are identified, how requirements are derived and written. They know the different types and levels of requirementsMethod: Participants can read requirements documents or models (links etc.). They can read and understand context descriptions and interface specificationsTool: Participants can read in the requirements tool and view and comment/review requirements."
        },
        "4": {
          "level_name": "Apply",
          "objective": "Process: Participants can independently identify sources of requirements, derive requirements from them, write them, document them in requirements documents or models, link them, derive them, analyze them.Method: Participants can independently document, link and analyze requirements documents or models. They can create and analyze context descriptions and interface specificationsTool: Participants can define, link and analyze requirements in a requirements tool."
        },
        "6": {
          "level_name": "Master",
          "objective": "Process: Participants are able to recognize shortcomings in the process and develop suggestions for improvement.Method: The participant is able to create context and interface descriptions and discuss these with stakeholders.Tool: Participants can use advanced functions in a requirements tool and create new templates, attributes and features.\n"
        }
      }
    },
    "6": {
      "competency_name": "System architecture design",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "Process: The participants know the purpose of architecture models. They can roughly categorize them in the development process.Method: The participants know that there is a dedicated methodology and modeling language for architecture modeling.Tool: Participants know that there is a dedicated tool for viewing and, if necessary, editing architecture models."
        },
        "2": {
          "level_name": "Understand",
          "objective": "Process: Participants can understand why architecture models are relevant as inputs and outputs of the development process.Method: Participants can read architecture models and extract relevant information from them.Tool: Participants can view architecture models in a tool and comment on/review them."
        },
        "4": {
          "level_name": "Apply",
          "objective": "Process: Participants know the relevant process steps for architecture models and know where their inputs come from in the development process and what outputs they produce.Method: Participants can create architecture models of average complexity. They are able to reproduce relevant information in accordance with the method and modeling language.Tool: Participants can create and analyze architecture models in a tool."
        },
        "6": {
          "level_name": "Master",
          "objective": "Process: Participants are able to recognize shortcomings in the process and develop suggestions for improvement.Method: Participants are able to create and manage models of high complexity. They can recognize shortcomings in the method or modeling language and develop suggestions for improvement.Tool: Participants can use advanced functions and create templates."
        }
      }
    },
    "7": {
      "competency_name": "Integration, verification & validation",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "The participant knows the objectives of verification and validation and knows different types and procedures of V&V."
        },
        "2": {
          "level_name": "Understand",
          "objective": "The participant can read and understand test plans, test cases and test results. "
        },
        "4": {
          "level_name": "Apply",
          "objective": "The participant can create test plans. They will be able to carry out and document tests and simulations."
        },
        "6": {
          "level_name": "Master",
          "objective": "The participant is able to set up a test strategy and a test plan independently and at an early stage. Based on the requirements and verification/validation criteria, they will be able to derive the necessary test cases. They will be able to orchestrate and document the tests and simulations. "
        }
      }
    },
    "8": {
      "competency_name": "Operation, service and maintenance",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "The participants know the lines of the operation, service and maintenance phase. They know that these are already taken into account during development and that there are activities in the respective phase."
        },
        "2": {
          "level_name": "Understand",
          "objective": "Participants understand how the operation, service and maintenance phases are taken into account in development. They will be able to name the activities that are necessary in the life cycle. "
        },
        "4": {
          "level_name": "Apply",
          "objective": "Participants understand how the operation, service and maintenance phases are taken into account in development. They will be able to process the phases and identify improvements for future projects. "
        },
        "6": {
          "level_name": "Master",
          "objective": "Participants will be able to define the organizational processes for operations, service and maintenance, "
        }
      }
    },
    "9": {
      "competency_name": "Agile methodological competence",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "Method: The participant knows the agile values and the relevant agile methods"
        },
        "2": {
          "level_name": "Understand",
          "objective": "Method: The participant understands the basics of agile working methods and how agile methods can be applied in a development process."
        },
        "4": {
          "level_name": "Apply",
          "objective": "Method: the participant can work in an agile environment. He is able to apply the necessary methods."
        },
        "6": {
          "level_name": "Master",
          "objective": "The participant can define and implement the relevant agile methods for a project. The participant is convinced that agile methods can be used profitably and can motivate others to do so. "
        }
      }
    },
    "10": {
      "competency_name": "Self-organization",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "Participants are familiar with the concepts of self-organization."
        },
        "2": {
          "level_name": "Understand",
          "objective": "Participants understand how the concepts of self-organization influence their everyday work"
        },
        "4": {
          "level_name": "Apply",
          "objective": "Participants are able to work on projects, processes and tasks in a self-organized manner. "
        },
        "6": {
          "level_name": "Master",
          "objective": "Participants are able to work on projects, processes and tasks in a self-organized manner. "
        }
      }
    },
    "11": {
      "competency_name": "Communication & collaboration",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "Participants know the necessity of these skills"
        },
        "2": {
          "level_name": "Understand",
          "objective": "Participant recognizes and understands the relevance of this competence, especially with regard to the application of SE"
        },
        "4": {
          "level_name": "Apply",
          "objective": "Participants are able to communicate constructively and efficiently and at the same time be empathetic towards their communication partner."
        },
        "6": {
          "level_name": "Master",
          "objective": "Participant is also able to manage their relationships with colleagues and superiors in a sustainable and fair way "
        }
      }
    },
    "12": {
      "competency_name": "Leadership",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "Participants know the necessity of these skills"
        },
        "2": {
          "level_name": "Understand",
          "objective": "Participant understands the relevance of defining goals for a system and can define them in a way that is understandable for the entire team"
        },
        "4": {
          "level_name": "Apply",
          "objective": "Participant is able to negotiate goals with the team and find an efficient way to achieve them."
        },
        "6": {
          "level_name": "Master",
          "objective": "Participant is able to strategically develop team members so that they continue to develop when finding solutions"
        }
      }
    },
    "13": {
      "competency_name": "Project management",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "Process: The participant is familiar with thematic field project management and can organize their activities in a project planMethod: The participant knows the common methods of project management.Tool: The participant understands why a tool is used for project management."
        },
        "2": {
          "level_name": "Understand",
          "objective": "Process: The participant understands the project assignment and can categorize project management in the context of system engineering.Methods: The participant can independently create the (project) plans relevant to him and generate corresponding status reports (with regard to Q-K-T).Tool: The participant is able to carry out planning in the respective tool."
        },
        "4": {
          "level_name": "Apply",
          "objective": "Process & Method: The participant is able to define a project assignment and set framework conditions, create complex project plans and generate meaningful reports. The participant is practiced in communicating with stakeholders. \nTool: The participant is able to carry out planning in the respective tool."
        },
        "6": {
          "level_name": "Master",
          "objective": "Process: The participant is able to identify shortcomings in the process and make suggestions for improvement. He is able to successfully communicate reports, plans and orders to all stakeholders.\nTool: Participants can use advanced functions and create templates."
        }
      }
    },
    "14": {
      "competency_name": "Decision management",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "Participants know the main decision-making bodies and how decisions are made"
        },
        "2": {
          "level_name": "Understand",
          "objective": "Participants learn about decision support methods and understand which decisions they can make themselves and which are made by Gremine etc."
        },
        "4": {
          "level_name": "Apply",
          "objective": "Participants are able to prepare decisions for their relevant scopes or make them themselves and document them accordingly. They can apply methods of decision support (e.g. utility analysis)."
        },
        "6": {
          "level_name": "Master",
          "objective": "Participants can evaluate decisions and are able to define and establish overarching decision-making bodies. They can define good guidelines for making decisions."
        }
      }
    },
    "15": {
      "competency_name": "Information management",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "The participant knows the advantages of established information and knowledge management."
        },
        "2": {
          "level_name": "Understand",
          "objective": "The participant knows the main platforms for knowledge transfer and knows which information needs to be passed on to whom."
        },
        "4": {
          "level_name": "Apply",
          "objective": "The participant knows the main platforms for knowledge transfer. They are able to define filing structures and documentation guidelines for projects and can make the relevant information available in the appropriate place."
        },
        "6": {
          "level_name": "Master",
          "objective": "The participant can define a comprehensive information management process. "
        }
      }
    },
    "16": {
      "competency_name": "Configuration management",
      "learning_objectives_by_level": {
        "1": {
          "level_name": "Know",
          "objective": "process. The participant understands the necessity of configuration management\nTool: The participant knows in which tools configuration items are to be created."
        },
        "2": {
          "level_name": "Understand",
          "objective": "Process: The participant understands the procedure for defining configuration items. He is able to recognize the configuration items relevant to him and to create an integer configuration for his relevant scopes.\nTool: The participant is able to create the tool(s) for his scopes"
        },
        "4": {
          "level_name": "Apply",
          "objective": "Process: The participant can define meaningful configuration items. He is able to recognize the configuration items relevant for him and to create an integer configuration for his relevant scopes.\nTool: The participant is able to define configuration items in the tool(s) and create them for his scopes"
        },
        "6": {
          "level_name": "Master",
          "objective": "Process: He is able to recognize all relevant configuration items and build an integer configuration across all configuration items. He is able to identify improvements and propose solutions. He can support others in forming configurations.\nTool: The participant is able to define configuration items in the tool(s) and form a configuration for all scopes."
        }
      }
    }
  }
}