{
  "metadata": {
    "description": "Systems Engineering Qualification Planning Tool - Complete Learning Objectives with Full Text Content",
    "source": "Qualifizierungsmodule_Qualifizierungspläne_v4 enUS.xlsx",
    "sheet": "Learning Objectives",
    "dataStructure": {
      "totalArchetypes": 6,
      "totalCompetencies": 16,
      "competencyLevels": [1, 2, 4, 6],
      "totalLearningObjectives": 64
    },
    "lastUpdated": "2024 - Renamed to standardized competency names",
    "verification": "Values verified against Marcel Niemeyer's Master Thesis Table 4-2 (page 67)"
  },
  
  "qualificationArchetypes": [
    "Common basic understanding",
    "SE for managers",
    "Orientation in pilot project",
    "Needs-based, project-oriented training",
    "Continuous support",
    "Train the trainer"
  ],
  
  "competencies": [
    {"id": 1, "name": "Systems Thinking", "originalName": "Systemic thinking"},
    {"id": 6, "name": "Systems Modelling and Analysis", "originalName": "System modeling and analysis"},
    {"id": 4, "name": "Lifecycle Consideration", "originalName": "Consideration of system life cycle phases"},
    {"id": 5, "name": "Customer / Value Orientation", "originalName": "Customer benefit orientation"},
    {"id": 14, "name": "Requirements Definition", "originalName": "Requirements management"},
    {"id": 15, "name": "System Architecting", "originalName": "System architecture design"},
    {"id": 16, "name": "Integration, Verification, Validation", "originalName": "Integration, verification & validation"},
    {"id": 17, "name": "Operation and Support", "originalName": "Operation, service and maintenance"},
    {"id": 18, "name": "Agile Methods", "originalName": "Agile methodological competence"},
    {"id": 9, "name": "Self-Organization", "originalName": "Self-organization"},
    {"id": 7, "name": "Communication", "originalName": "Communication & collaboration"},
    {"id": 8, "name": "Leadership", "originalName": "Leadership"},
    {"id": 10, "name": "Project Management", "originalName": "Project management"},
    {"id": 11, "name": "Decision Management", "originalName": "Decision management"},
    {"id": 12, "name": "Information Management", "originalName": "Information management"},
    {"id": 13, "name": "Configuration Management", "originalName": "Configuration management"}
  ],
  
  "competencyCategories": {
    "Core Competencies": [1, 4, 5, 6],
    "Social / Personal Competencies": [7, 8, 9],
    "Management Competencies": [10, 11, 12, 13],
    "Technical Competencies": [14, 15, 16, 17, 18]
  },
  
  "archetypeCompetencyTargetLevels": {
    "Common basic understanding": {
      "Systems Thinking": 2,
      "Systems Modelling and Analysis": 2,
      "Lifecycle Consideration": 2,
      "Customer / Value Orientation": 2,
      "Requirements Definition": 2,
      "System Architecting": 2,
      "Integration, Verification, Validation": 2,
      "Operation and Support": 1,
      "Agile Methods": 2,
      "Self-Organization": 2,
      "Communication": 1,
      "Leadership": 1,
      "Project Management": 2,
      "Decision Management": 1,
      "Information Management": 1,
      "Configuration Management": 1
    },
    "SE for managers": {
      "Systems Thinking": 4,
      "Systems Modelling and Analysis": 1,
      "Lifecycle Consideration": 1,
      "Customer / Value Orientation": 2,
      "Requirements Definition": 1,
      "System Architecting": 1,
      "Integration, Verification, Validation": 1,
      "Operation and Support": 1,
      "Agile Methods": 1,
      "Self-Organization": 1,
      "Communication": 4,
      "Leadership": 4,
      "Project Management": 2,
      "Decision Management": 4,
      "Information Management": 2,
      "Configuration Management": 1
    },
    "Orientation in pilot project": {
      "Systems Thinking": 4,
      "Systems Modelling and Analysis": 4,
      "Lifecycle Consideration": 4,
      "Customer / Value Orientation": 4,
      "Requirements Definition": 4,
      "System Architecting": 4,
      "Integration, Verification, Validation": 4,
      "Operation and Support": 4,
      "Agile Methods": 4,
      "Self-Organization": 4,
      "Communication": 4,
      "Leadership": 4,
      "Project Management": 4,
      "Decision Management": 4,
      "Information Management": 4,
      "Configuration Management": 4
    },
    "Needs-based, project-oriented training": {
      "Systems Thinking": 4,
      "Systems Modelling and Analysis": 4,
      "Lifecycle Consideration": 4,
      "Customer / Value Orientation": 4,
      "Requirements Definition": 4,
      "System Architecting": 4,
      "Integration, Verification, Validation": 4,
      "Operation and Support": 4,
      "Agile Methods": 4,
      "Self-Organization": 4,
      "Communication": 4,
      "Leadership": 4,
      "Project Management": 4,
      "Decision Management": 4,
      "Information Management": 4,
      "Configuration Management": 4
    },
    "Continuous support": {
      "Systems Thinking": 2,
      "Systems Modelling and Analysis": 4,
      "Lifecycle Consideration": 4,
      "Customer / Value Orientation": 2,
      "Requirements Definition": 4,
      "System Architecting": 4,
      "Integration, Verification, Validation": 4,
      "Operation and Support": 4,
      "Agile Methods": 4,
      "Self-Organization": 4,
      "Communication": 4,
      "Leadership": 4,
      "Project Management": 4,
      "Decision Management": 4,
      "Information Management": 4,
      "Configuration Management": 4
    },
    "Train the trainer": {
      "Systems Thinking": 6,
      "Systems Modelling and Analysis": 6,
      "Lifecycle Consideration": 6,
      "Customer / Value Orientation": 6,
      "Requirements Definition": 6,
      "System Architecting": 6,
      "Integration, Verification, Validation": 6,
      "Operation and Support": 6,
      "Agile Methods": 6,
      "Self-Organization": 6,
      "Communication": 6,
      "Leadership": 6,
      "Project Management": 6,
      "Decision Management": 6,
      "Information Management": 6,
      "Configuration Management": 6
    }
  },
  
  "learningObjectiveTemplates": {
    "Systems Thinking": {
      "1": "The participant knows the interrelationships of their system and the associated system boundaries.",
      "2": "The participant understands the interaction of the individual components that make up the system.",
      "4": "The participant is able to analyze his existing system and derive continuous improvements from it. The participant is also able to establish system thinking among colleagues.",
      "6": "The participant is able to bring systems thinking into the company and inspire others to do the same. In addition, the participant can independently define or at least question the system limits/scope."
    },
    "Systems Modelling and Analysis": {
      "1": "Participants know the basis of modeling and its benefits.",
      "2": "Participants understand how models support their work. They are able to read models easily.",
      "4": "Participants are able to independently define their own system models for their relevant scope. They can also correctly classify and understand various models.",
      "6": "Participants can set guidelines for (necessary) models and write guidelines for good modeling."
    },
    "Lifecycle Consideration": {
      "1": "Participants know the life cycle phases of their system",
      "2": "The participant understands why and how all life cycle phases must be considered in the context of development or application of the system.",
      "4": "The participant is able to identify, consider and evaluate all life cycle phases for the scopes relevant to him.",
      "6": "The participant is able to evaluate concepts with regard to the consideration of all life cycle phases, identify weaknesses in the methodology and make suggestions for improvement."
    },
    "Customer / Value Orientation": {
      "1": "The participant recognizes the basic principles of agile thinking.",
      "2": "The participant understands how agile thinking can be integrated into everyday working life",
      "4": "The participant is able to develop a system according to agile thinking and to put the customer benefit in the foreground.",
      "6": "The participant is able to bring agile thinking into the company and inspire others to do the same. In addition, the participant can independently define agile methods for the projects."
    },
    "Requirements Definition": {
      "1": "Process: Participants can differentiate between requirements, stakeholder requirements, system requirements and sub-system requirements and understand their interactions.\nMethod: The participants know the different processes of requirements management and are able to derive user/customer requirements.\nTool: The participant knows how to create a requirements table.",
      "2": "Process: Participants understand how requirements sources are identified, how requirements are derived from sources, and how the requirements of a system are passed on to the subsystem.\nMethod: Participants know and understand how and when which requirements formats are used efficiently. (Text vs. spreadsheet vs. database)\nTool: Participants can easily read requirements in a database.",
      "4": "Process: Participants can independently identify sources of requirements, derive requirements from them, and transfer system requirements to subsystem requirements.\nMethod: Participants are able to formulate requirements correctly (e.g. \"good criteria\") and to find an efficient methodology for eliciting requirements.\nTool: The participants are able to create, edit and extend requirements in a requirements database independently.",
      "6": "Process: Participants are able to recognize shortcomings in the process and develop suggestions for improvement. He is able to guide and evaluate the requirements processes.\nMethod: The participant is able to use and introduce all relevant requirements methods in the company and to guide colleagues in the formulation of requirements.\nTool: Participants are able to bring requirements tools into the enterprise and guide colleagues in setting up requirements in the tool. He is also able to introduce new tools or improve existing ones."
    },
    "System Architecting": {
      "1": "Process: The participants know the purpose of architecture models. They can roughly categorize them and understand which problems they solve.\nMethod: The participant knows the various processes of system architecture (logical and physical architectures).\nTool: The participants know SysML and are able to understand simple representations.",
      "2": "Process: Participants can understand why architecture models are relevant as inputs and outputs of the process step and why the architecture is relevant as a design guideline for the system.\nMethod: The participant understands the various processes of system architecture (logical and physical architectures). He is able to derive the architecture of a system from its requirements.\nTool: The participants can read and understand SysML notations.",
      "4": "Process: Participants know the relevant process steps for architecture models and know where their inputs come from and where the outputs must go. Participants are able to understand architecture development at system and subsystem level.\nMethod: The participant is able to independently develop a system architecture. The system architecture is traceable from the requirements.\nTool: The participants are able to build various SysML diagrams themselves.",
      "6": "Process: Participants are able to recognize shortcomings in the process and develop suggestions for improvement.\nMethod: The participant is able to use and introduce all relevant architecture development methods in the company.\nTool: The participants are able to set up and/or optimize the toolchain for system modeling in the company."
    },
    "Integration, Verification, Validation": {
      "1": "The participant knows the objectives of verification and validation and knows different types and procedures.",
      "2": "The participant can read and understand test plans, test cases and test results.",
      "4": "The participant can create test plans. They will be able to carry out and document tests and simulations.",
      "6": "The participant is able to set up a test strategy and a test plan independently and at an early stage and to document the test planning. He is also able to plan and conduct design reviews."
    },
    "Operation and Support": {
      "1": "The participants know the lines of the operation, service and maintenance phase. They know that these are of great importance for the project.",
      "2": "Participants understand how the operation, service and maintenance phases are taken into account in the development of a system. You understand the need for redundancy in the design.",
      "4": "Participants understand how the operation, service and maintenance phases are taken into account in the development of a system. The participant is able to develop concepts and systems that ensure the availability of the system.",
      "6": "Participants will be able to define the organizational processes for operations, service and maintenance and place them in the context of the entire life cycle."
    },
    "Agile Methods": {
      "1": "Method: The participant knows the agile values and the relevant agile methods",
      "2": "Method: The participant understands the basics of agile working methods and how agile methods can be used in his work.",
      "4": "Method: the participant can work in an agile environment. He is able to apply the necessary methods.",
      "6": "The participant can define and implement the relevant agile methods for a project. The participant is able to teach and introduce agile methods to others in the company."
    },
    "Self-Organization": {
      "1": "Participants are familiar with the concepts of self-organization.",
      "2": "Participants understand how the concepts of self-organization influence their everyday work",
      "4": "Participants are able to work on projects, processes and tasks in a self-organized manner.",
      "6": "Participants are able to work on projects, processes and tasks in a self-organized manner."
    },
    "Communication": {
      "1": "Participants know the necessity of these skills",
      "2": "Participant recognizes and understands the relevance of this competence, especially with regard to the optimal functioning of his team.",
      "4": "Participants are able to communicate constructively and efficiently and at the same time be empathetic to the needs and ideas of their colleagues. They are able to cooperate in interdisciplinary teams. The participant is able to challenge and be challenged and see it as their strength.",
      "6": "Participant is also able to manage their relationships with colleagues and superiors in a sustainable manner. The participant is able to resolve conflicts, bring different perspectives together, negotiate sustainable compromises and thus also lead groups."
    },
    "Leadership": {
      "1": "Participants know the necessity of these skills",
      "2": "Participant understands the relevance of defining goals for a system and can define them in a way that benefits the team.",
      "4": "Participant is able to negotiate goals with the team and find an efficient way to achieve them.",
      "6": "Participant is able to strategically develop team members so that they continue to develop when finding solutions."
    },
    "Project Management": {
      "1": "Process: The participant is familiar with thematic field project management and can organize their activities according to it.",
      "2": "Process: The participant understands the project assignment and can categorize project management into the overall procedure. The participant is able to work in a project according to the standards and create the relevant outputs.",
      "4": "Process & Method: The participant is able to define a project assignment and set framework conditions. He is able to take control of the project team and guide them in achieving the project objectives. The participant is able to apply the relevant project management methods.",
      "6": "Process: The participant is able to identify shortcomings in the process and make suggestions for improvement.\nMethod: The participant is able to use and introduce all relevant project management methods in the company."
    },
    "Decision Management": {
      "1": "Participants know the main decision-making bodies and how decisions are made",
      "2": "Participants learn about decision support methods and understand which decisions they can make themselves and which they must delegate",
      "4": "Participants are able to prepare decisions for their relevant scopes or make them themselves and document the decision-making process accordingly.",
      "6": "Participants can evaluate decisions and are able to define and establish overarching decision-making processes that facilitate traceable and sustainable decisions."
    },
    "Information Management": {
      "1": "The participant knows the advantages of established information and knowledge management.",
      "2": "The participant knows the main platforms for knowledge transfer and knows which information needs to be documented.",
      "4": "The participant knows the main platforms for knowledge transfer. They are able to define filing structures for the project. He is able to maintain and provide project information independently.",
      "6": "The participant can define a comprehensive information management process."
    },
    "Configuration Management": {
      "1": "process. The participant understands the necessity of configuration management\nTool: The participant knows the principle of version control and understands configuration control.",
      "2": "Process: The participant understands the procedure for defining configuration items. He is able to read and understand configurations defined by others.\nTool: The participant is able to read version histories. The participant is able to create configurations/baselines.",
      "4": "Process: The participant can define meaningful configuration items. He is able to recognize the configuration items relevant to him. The participant can carry out changes to the configuration under controlled conditions.\nTool: The participant is able to set up version control for their project.",
      "6": "Process: He is able to recognize all relevant configuration items and build an integer configuration with them. The participant is able to establish the topic in the company and to take over guidance.\nTool: The participant is able to set up the relevant tool landscape for configuration management in the company."
    }
  },
  
  "implementation_guidance": {
    "dataStructure": {
      "step1": "Identify the qualification archetype/strategy for the company",
      "step2": "For each competency, look up the target level in 'archetypeCompetencyTargetLevels'",
      "step3": "Retrieve the corresponding learning objective text from 'learningObjectiveTemplates'",
      "step4": "Use RAG LLM to customize the standard objective based on company context"
    },
    "example": {
      "scenario": "Company classified as 'SE for managers'",
      "competency": "Decision Management",
      "competencyId": 11,
      "lookupProcess": [
        "1. archetypeCompetencyTargetLevels['SE for managers']['Decision Management'] = 4",
        "2. learningObjectiveTemplates['Decision Management']['4'] = 'Participants are able to prepare decisions...'",
        "3. Feed to RAG LLM with company PMT context for customization"
      ]
    },
    "ragLLMInput": {
      "standardObjective": "From learningObjectiveTemplates",
      "companyContext": {
        "processes": "Company's specific SE processes",
        "methods": "Currently used methods",
        "tools": "Existing tool landscape",
        "roleStructure": "Mapped role clusters",
        "industryContext": "Sector-specific requirements"
      },
      "expectedOutput": "Company-specific learning objective adapted to their context"
    }
  }
}