[
  {
    "SE Training Strategies": "SE for managers",
    "Description": "This strategy focuses in particular on managers. They play a major role in the introduction of SE, particularly with regard to change management. They are enablers of change in a company and therefore need an understanding of what it means to introduce and use SE. SE for managers can communicate the benefits of SE in an understandable way. The strategy is suitable for the introductory phase and creates the qualification level \"Understanding\"."
  },
  {
    "SE Training Strategies": "Common basic understanding",
    "Description": "This strategy is an approach that focuses on interdisciplinary exchange and thus creates awareness for the topic of SE. The focus here is on understanding the fundamental interrelationships of SE as part of basic training and reflecting on them in the group. This allows all stakeholders to come together regardless of their level of expertise. The strategy is suitable for the motivation phase of the SE introduction and serves to achieve the qualification goal of \"recognition\"."
  },
  {
    "SE Training Strategies": "Orientation in pilot project",
    "Description": "The strategy follows an application-oriented approach to qualification. On the one hand, participants should gain an orientation in SE, on the other hand, the application of SE should be qualified in a pilot project. Here, a team of developers is trained and thus independently recognizes the added value of SE through its application. At the beginning there is an initial introduction, followed by continuous coaching. With an orientation in the pilot project, the qualification goal of \"application\" can be achieved."
  },
  {
    "SE Training Strategies": "Certification",
    "Description": "Certifications are part of the \"orientation in the pilot project\" strategy. In this work, certification is defined as a separate strategy due to its typical characteristics, such as fixed and standardized training content and the issuing of certification certificates. Typical certifications for the SE are SE- Zert and CSEP. Certifications are suitable for the qualification objective \"Apply\" and can be used in the motivation phase of the introduction."
  },
  {
    "SE Training Strategies": "Continuous support",
    "Description": "This qualification strategy focuses on the aspect of continuous learning in an organization. Based on self-directed, proactive learning, employee queries are are collected, documented and answered. Continuous support requires a trained organization where processes, methods and tools are already defined. This strategy is therefore suitable for the continuation phase of the SE introduction. The aim of this strategy is application"
  },
  {
    "SE Training Strategies": "Needs-based project-oriented training",
    "Description": "This strategy is aimed at targeted further training for specific roles within the company. Projects are accompanied over a longer period of time and basic and expert knowledge is imparted as part of training courses. At the beginning, all participants take part in basic training. The knowledge is then deepened for specific roles. New in-depth training courses on individual topics can be used repeatedly throughout a project. In this way, the SE methods can be applied. Processes, methods and tools must already have been defined and roles and tasks specified. Needs-based, project-oriented training courses are suitable for understanding and for the qualification goal of \"application\"."
  },
  {
    "SE Training Strategies": "Train the SE-trainer",
    "Description": "This strategy focuses on the training of coaches and trainers with the task of bringing SE into the company. Three areas must be taken into account. Firstly, the challenges and working methods of the company must be communicated to the trainers. Secondly, the necessary SE skills must be identified. Thirdly, the necessary didactic and moderation skills must be imparted. Either internal trainers can be trained or external service providers can be recruited to learn the company-specific conditions. For this strategy, the qualification objective \"mastery\" must be achieved. Since the training of trainers is relevant for all strategies, the decision on this strategy is made in addition to the selection of the remaining strategies."
  }
]