{
  "learning_objectives_definition": {
    "description": "A learning objective is a description of the state in which the participants find themselves at the end of the course/module in terms of competence, knowledge and qualifications."
  },
  "smart_criteria": {
    "S": {
      "criterion": "Specific",
      "description": "Clearly define what the learner will be able to do"
    },
    "M": {
      "criterion": "Measurable",
      "description": "Include observable and measurable outcomes",
      "technique": "Use 'by' to demonstrate measurability and observability"
    },
    "A": {
      "criterion": "Achievable",
      "description": "Ensure the objective is realistic given the timeframe and resources"
    },
    "R": {
      "criterion": "Relevant",
      "description": "Align with the competence level and role requirements",
      "technique": "Formulate benefits using 'so that' and 'in order to'"
    },
    "T": {
      "criterion": "Time-bound",
      "description": "Specify when the objective should be achieved (e.g., 'At the end of the two-day course')"
    }
  },
  "formulation_guidelines": {
    "positive_formulation": {
      "rule": "Learning objectives should be formulated positively",
      "example_good": "The participants know all ten important product features",
      "example_bad": "The participants will no longer be unfamiliar with product features"
    },
    "measurability_observability": {
      "rule": "Demonstrate measurability and observability through 'by'",
      "example": "They explain the features and benefits by conducting a simulated customer discussion"
    },
    "benefit_formulation": {
      "rule": "Formulate benefits through 'so that' and 'in order to'",
      "example": "This enables the participants to successfully complete the subsequent sales training"
    },
    "pmt_consideration": {
      "rule": "Learning objectives should take processes, methods and tools (PMT) into account",
      "description": "Reference specific SE processes, methodologies, and tools relevant to the competency"
    },
    "maturity_alignment": {
      "rule": "Compare competence levels with the maturity model",
      "description": "Align target levels with organizational maturity and archetype requirements"
    }
  },
  "structure_template": {
    "components": [
      "Timeframe (At the end of...)",
      "Target audience (the participants)",
      "Action verb (know, understand, apply, analyze, create)",
      "Subject matter (competency-specific content)",
      "Measurable demonstration (by + observable action)",
      "Benefit statement (so that / in order to + outcome)"
    ],
    "full_structure": "At the end of [TIMEFRAME], [AUDIENCE] [ACTION_VERB] [SUBJECT_MATTER] by [OBSERVABLE_ACTION], so that [BENEFIT]."
  },
  "example_complete": {
    "timeframe": "At the end of the two-day course",
    "audience": "the participants",
    "knowledge": "know all ten important product features and their benefits",
    "demonstration": "They explain the features and benefits in a simulated customer discussion",
    "benefit": "This enables the participants to successfully complete the subsequent sales training",
    "full_objective": "At the end of the two-day course, the participants know all ten important product features and their benefits. They explain the features and benefits in a simulated customer discussion. This enables the participants to successfully complete the subsequent sales training."
  },
  "action_verbs_by_level": {
    "level_1_awareness": {
      "blooms_taxonomy": "Remember",
      "verbs": ["know", "list", "name", "identify", "recall", "recognize", "state"]
    },
    "level_2_basic": {
      "blooms_taxonomy": "Understand",
      "verbs": ["explain", "describe", "summarize", "interpret", "classify", "compare"]
    },
    "level_3_intermediate": {
      "blooms_taxonomy": "Apply",
      "verbs": ["apply", "use", "demonstrate", "implement", "execute", "solve"]
    },
    "level_4_advanced": {
      "blooms_taxonomy": "Analyze/Evaluate",
      "verbs": ["analyze", "evaluate", "assess", "critique", "justify", "recommend"]
    },
    "level_5_expert": {
      "blooms_taxonomy": "Create",
      "verbs": ["create", "design", "develop", "formulate", "construct", "establish"]
    }
  },
  "competency_specific_examples": {
    "systems_thinking": {
      "level_2": "At the end of the one-week module, participants understand the fundamental principles of systems thinking by identifying system boundaries and key interfaces in a provided case study, so that they can recognize systemic dependencies in their own projects.",
      "level_3": "At the end of the two-week module, participants apply systems thinking approaches by creating a system context diagram for their current project using SysML notation, in order to improve stakeholder communication and reduce interface conflicts.",
      "level_4": "At the end of the four-week program, participants analyze complex systems by performing trade-off analyses considering multiple lifecycle phases, so that they can make informed architectural decisions that optimize system performance across the entire lifecycle."
    },
    "requirements_definition": {
      "level_2": "At the end of the five-day course, participants understand requirements engineering fundamentals by distinguishing between stakeholder needs, system requirements, and design constraints in example scenarios, so that they can structure requirements appropriately in their projects.",
      "level_3": "At the end of the three-week module, participants define system requirements by eliciting, analyzing, and documenting requirements using DOORS or similar tools, in order to establish a traceable requirements baseline for their project.",
      "level_4": "At the end of the six-week program, participants evaluate requirements quality by conducting peer reviews and applying verification criteria, so that they can ensure requirements are complete, consistent, and testable before design begins."
    },
    "project_management": {
      "level_2": "At the end of the three-day workshop, participants understand project management fundamentals in SE context by creating a work breakdown structure (WBS) for a sample SE project, so that they can plan their work more systematically.",
      "level_3": "At the end of the four-week module, participants manage SE project activities by developing integrated schedules using MS Project or similar tools, considering technical dependencies and resource constraints, in order to deliver projects on time and within budget.",
      "level_4": "At the end of the eight-week program, participants optimize project performance by implementing earned value management (EVM) and conducting risk assessments, so that they can proactively identify and mitigate project issues."
    }
  }
}
