{
  "metadata": {
    "description": "Systems Engineering Qualification Planning Tool - Complete Learning Objectives with PMT Breakdown",
    "source": "Qualifizierungsmodule_Qualifizierungspläne_v4_enUS.xlsx",
    "sheet": "Learning Objectives",
    "dataStructure": {
      "totalArchetypes": 7,
      "totalCompetencies": 16,
      "competencyLevels": [
        1,
        2,
        4,
        6
      ],
      "totalLearningObjectives": 64
    },
    "lastUpdated": "2025-12-02",
    "version": "2.1",
    "changes": [
      "Added PMT breakdown structure for applicable competencies",
      "Fixed translation artifacts (Gremien->committees, integre->complete, Zeile->aspects)",
      "Made language gender-neutral (he/she -> they)",
      "Ensured all LOs describe end-state capabilities",
      "Fixed incomplete sentences",
      "v2.1: Added full PMT breakdown for Integration, Verification, Validation (ID: 16)",
      "v2.1: Added full PMT breakdown for Decision Management (ID: 11)",
      "v2.1: Added full PMT breakdown for Information Management (ID: 12)"
    ],
    "pmtCompetencies": {
      "fullPMT": [
        14,
        15,
        16,
        11,
        12
      ],
      "partialPMT": [
        10,
        13,
        18
      ],
      "noPMT": [
        1,
        4,
        5,
        6,
        7,
        8,
        9,
        17
      ]
    },
    "loDefinition": "A learning objective is a description of the STATE in which the PARTICIPANTS find themselves AT THE END of the course/module in terms of competence, knowledge and qualifications."
  },
  "qualificationArchetypes": [
    "Common basic understanding",
    "SE for managers",
    "Orientation in pilot project",
    "Needs-based, project-oriented training",
    "Continuous support",
    "Train the trainer",
    "Certification"
  ],
  "competencies": [
    {
      "id": 1,
      "name": "Systems Thinking",
      "category": "Core",
      "hasPMT": false
    },
    {
      "id": 4,
      "name": "Lifecycle Consideration",
      "category": "Core",
      "hasPMT": false
    },
    {
      "id": 5,
      "name": "Customer / Value Orientation",
      "category": "Core",
      "hasPMT": false
    },
    {
      "id": 6,
      "name": "Systems Modelling and Analysis",
      "category": "Core",
      "hasPMT": false
    },
    {
      "id": 7,
      "name": "Communication",
      "category": "Social",
      "hasPMT": false
    },
    {
      "id": 8,
      "name": "Leadership",
      "category": "Social",
      "hasPMT": false
    },
    {
      "id": 9,
      "name": "Self-Organization",
      "category": "Social",
      "hasPMT": false
    },
    {
      "id": 10,
      "name": "Project Management",
      "category": "Management",
      "hasPMT": true
    },
    {
      "id": 11,
      "name": "Decision Management",
      "category": "Management",
      "hasPMT": true
    },
    {
      "id": 12,
      "name": "Information Management",
      "category": "Management",
      "hasPMT": true
    },
    {
      "id": 13,
      "name": "Configuration Management",
      "category": "Management",
      "hasPMT": true
    },
    {
      "id": 14,
      "name": "Requirements Definition",
      "category": "Technical",
      "hasPMT": true
    },
    {
      "id": 15,
      "name": "System Architecting",
      "category": "Technical",
      "hasPMT": true
    },
    {
      "id": 16,
      "name": "Integration, Verification, Validation",
      "category": "Technical",
      "hasPMT": true
    },
    {
      "id": 17,
      "name": "Operation and Support",
      "category": "Technical",
      "hasPMT": false
    },
    {
      "id": 18,
      "name": "Agile Methods",
      "category": "Technical",
      "hasPMT": true
    }
  ],
  "competencyCategories": {
    "Core Competencies": [
      1,
      4,
      5,
      6
    ],
    "Social / Personal Competencies": [
      7,
      8,
      9
    ],
    "Management Competencies": [
      10,
      11,
      12,
      13
    ],
    "Technical Competencies": [
      14,
      15,
      16,
      17,
      18
    ]
  },
  "archetypeCompetencyTargetLevels": {
    "Common basic understanding": {
      "Systems Thinking": 2,
      "Systems Modelling and Analysis": 2,
      "Lifecycle Consideration": 2,
      "Customer / Value Orientation": 2,
      "Requirements Definition": 2,
      "System Architecting": 2,
      "Integration, Verification, Validation": 2,
      "Operation and Support": 1,
      "Agile Methods": 2,
      "Self-Organization": 2,
      "Communication": 1,
      "Leadership": 1,
      "Project Management": 2,
      "Decision Management": 1,
      "Information Management": 1,
      "Configuration Management": 1
    },
    "SE for managers": {
      "Systems Thinking": 4,
      "Systems Modelling and Analysis": 1,
      "Lifecycle Consideration": 1,
      "Customer / Value Orientation": 2,
      "Requirements Definition": 1,
      "System Architecting": 1,
      "Integration, Verification, Validation": 1,
      "Operation and Support": 1,
      "Agile Methods": 1,
      "Self-Organization": 1,
      "Communication": 4,
      "Leadership": 4,
      "Project Management": 2,
      "Decision Management": 4,
      "Information Management": 2,
      "Configuration Management": 1
    },
    "Orientation in pilot project": {
      "Systems Thinking": 4,
      "Systems Modelling and Analysis": 4,
      "Lifecycle Consideration": 4,
      "Customer / Value Orientation": 4,
      "Requirements Definition": 4,
      "System Architecting": 4,
      "Integration, Verification, Validation": 4,
      "Operation and Support": 4,
      "Agile Methods": 4,
      "Self-Organization": 4,
      "Communication": 4,
      "Leadership": 4,
      "Project Management": 4,
      "Decision Management": 4,
      "Information Management": 4,
      "Configuration Management": 4
    },
    "Needs-based, project-oriented training": {
      "Systems Thinking": 4,
      "Systems Modelling and Analysis": 4,
      "Lifecycle Consideration": 4,
      "Customer / Value Orientation": 4,
      "Requirements Definition": 4,
      "System Architecting": 4,
      "Integration, Verification, Validation": 4,
      "Operation and Support": 4,
      "Agile Methods": 4,
      "Self-Organization": 4,
      "Communication": 4,
      "Leadership": 4,
      "Project Management": 4,
      "Decision Management": 4,
      "Information Management": 4,
      "Configuration Management": 4
    },
    "Continuous support": {
      "Systems Thinking": 2,
      "Systems Modelling and Analysis": 4,
      "Lifecycle Consideration": 4,
      "Customer / Value Orientation": 2,
      "Requirements Definition": 4,
      "System Architecting": 4,
      "Integration, Verification, Validation": 4,
      "Operation and Support": 4,
      "Agile Methods": 4,
      "Self-Organization": 4,
      "Communication": 4,
      "Leadership": 4,
      "Project Management": 4,
      "Decision Management": 4,
      "Information Management": 4,
      "Configuration Management": 4
    },
    "Train the trainer": {
      "Systems Thinking": 6,
      "Systems Modelling and Analysis": 6,
      "Lifecycle Consideration": 6,
      "Customer / Value Orientation": 6,
      "Requirements Definition": 6,
      "System Architecting": 6,
      "Integration, Verification, Validation": 6,
      "Operation and Support": 6,
      "Agile Methods": 6,
      "Self-Organization": 6,
      "Communication": 6,
      "Leadership": 6,
      "Project Management": 6,
      "Decision Management": 6,
      "Information Management": 6,
      "Configuration Management": 6
    },
    "Certification": {
      "Systems Thinking": 4,
      "Systems Modelling and Analysis": 4,
      "Lifecycle Consideration": 4,
      "Customer / Value Orientation": 4,
      "Requirements Definition": 4,
      "System Architecting": 4,
      "Integration, Verification, Validation": 4,
      "Operation and Support": 4,
      "Agile Methods": 4,
      "Self-Organization": 4,
      "Communication": 4,
      "Leadership": 4,
      "Project Management": 4,
      "Decision Management": 4,
      "Information Management": 4,
      "Configuration Management": 4
    }
  },
  "learningObjectiveTemplates": {
    "Systems Thinking": {
      "1": "The participant knows the interrelationships of their system and the associated system boundaries.",
      "2": "The participant understands the interaction of the individual components that make up the system.",
      "4": "The participant is able to analyze their existing system and derive continuous improvements from it. The participant is also able to establish systems thinking among colleagues.",
      "6": "The participant is able to bring systems thinking into the company and inspire others to do the same. The participant can independently define or question the system limits and scope."
    },
    "Systems Modelling and Analysis": {
      "1": "Participants know the basis of modeling and its benefits.",
      "2": "Participants understand how models support their work. They are able to read models easily.",
      "4": "Participants are able to independently define their own system models for their relevant scope. They can correctly classify and understand various models.",
      "6": "Participants can set guidelines for models and write guidelines for good modeling."
    },
    "Lifecycle Consideration": {
      "1": "Participants know the life cycle phases of their system.",
      "2": "The participant understands why and how all life cycle phases must be considered in the context of development or application of the system.",
      "4": "The participant is able to identify, consider and evaluate all life cycle phases for their relevant scopes.",
      "6": "The participant is able to evaluate concepts with regard to all life cycle phases, identify weaknesses in the methodology and make suggestions for improvement."
    },
    "Customer / Value Orientation": {
      "1": "The participant recognizes the basic principles of customer-centric and value-driven thinking.",
      "2": "The participant understands how customer-centric thinking can be integrated into everyday working life.",
      "4": "The participant is able to develop a system with the customer benefit in the foreground and apply value-driven prioritization.",
      "6": "The participant is able to bring customer-centric thinking into the company and inspire others to do the same. The participant can independently define value-driven methods for projects."
    },
    "Communication": {
      "1": "Participants know the necessity of effective communication and collaboration skills.",
      "2": "Participants recognize and understand the relevance of this competence, especially with regard to the optimal functioning of their team.",
      "4": "Participants are able to communicate constructively and efficiently while being empathetic to the needs and ideas of their colleagues. They can cooperate in interdisciplinary teams.",
      "6": "Participants are able to manage their relationships with colleagues and superiors in a sustainable manner. They can resolve conflicts, bring different perspectives together, and negotiate sustainable compromises."
    },
    "Leadership": {
      "1": "Participants know the necessity of leadership skills in SE contexts.",
      "2": "Participants understand the relevance of defining goals for a system and can define them in a way that benefits the team.",
      "4": "Participants are able to negotiate goals with the team and find an efficient way to achieve them.",
      "6": "Participants are able to strategically develop team members so that they continue to develop when finding solutions."
    },
    "Self-Organization": {
      "1": "Participants are familiar with the concepts of self-organization.",
      "2": "Participants understand how the concepts of self-organization influence their everyday work.",
      "4": "Participants are able to work on projects, processes and tasks in a self-organized manner.",
      "6": "Participants are able to work on complex projects, processes and tasks in a fully self-organized manner and can guide others in self-organization practices."
    },
    "Project Management": {
      "1": {
        "unified": "The participant is familiar with project management fundamentals and can organize their activities in a project plan. They know common methods and understand why tools are used.",
        "pmt_breakdown": {
          "process": "The participant is familiar with project management and can organize their activities in a project plan.",
          "method": "The participant knows the common methods of project management.",
          "tool": "The participant understands why tools are used for project management."
        }
      },
      "2": {
        "unified": "The participant understands the project assignment and can categorize project management in the context of systems engineering. They can create relevant plans and generate status reports.",
        "pmt_breakdown": {
          "process": "The participant understands the project assignment and can categorize project management in the context of systems engineering.",
          "method": "The participant can independently create the relevant project plans and generate corresponding status reports (regarding quality, cost, time).",
          "tool": "The participant is able to carry out planning in the respective tool."
        }
      },
      "4": {
        "unified": "The participant is able to define a project assignment, set framework conditions, create complex project plans and generate meaningful reports. They are practiced in communicating with stakeholders and can use project management tools effectively.",
        "pmt_breakdown": {
          "process": "The participant is able to define a project assignment and set framework conditions.",
          "method": "The participant can create complex project plans and generate meaningful reports. They are practiced in communicating with stakeholders.",
          "tool": "The participant is able to carry out planning in the respective tool."
        }
      },
      "6": {
        "unified": "The participant is able to identify shortcomings in the process and make suggestions for improvement. They can successfully communicate reports, plans and orders to all stakeholders and use advanced tool functions.",
        "pmt_breakdown": {
          "process": "The participant is able to identify shortcomings in the process and make suggestions for improvement. They can successfully communicate reports, plans and orders to all stakeholders.",
          "method": "The participant is able to use and introduce all relevant project management methods in the company.",
          "tool": "The participant can use advanced functions and create templates."
        }
      }
    },
    "Decision Management": {
      "1": {
        "unified": "Participants know the main decision-making bodies and how decisions are made. They are aware of decision support methods and that decision tracking tools exist.",
        "pmt_breakdown": {
          "process": "Participants know the main decision-making bodies and understand the decision-making process flow, including escalation paths.",
          "method": "Participants know that decision support methods exist (e.g., trade-off analysis, decision matrices, weighted criteria).",
          "tool": "Participants know that tools exist for tracking and documenting decisions."
        }
      },
      "2": {
        "unified": "Participants understand decision support methods and know which decisions they can make themselves and which must be escalated. They can read and understand decision documentation in tracking tools.",
        "pmt_breakdown": {
          "process": "Participants understand the decision-making process and know which decisions they can make themselves and which must be escalated to committees.",
          "method": "Participants understand decision support methods such as trade-off analysis and decision matrices. They can apply basic criteria weighting.",
          "tool": "Participants can read and understand decision documentation in decision tracking tools or databases."
        }
      },
      "4": {
        "unified": "Participants are able to prepare decisions for their relevant scopes, apply decision methods, document the process accordingly, and use decision tracking tools effectively.",
        "pmt_breakdown": {
          "process": "Participants are able to prepare decisions for their relevant scopes or make them themselves. They can ensure proper documentation and traceability of the decision-making process.",
          "method": "Participants can apply decision support methods (trade-off analysis, decision matrices) to structure complex decisions and document rationale.",
          "tool": "Participants can independently create and maintain decision records in decision tracking tools."
        }
      },
      "6": {
        "unified": "Participants can evaluate decisions and establish overarching decision-making processes. They can introduce decision methods company-wide and set up the decision management toolchain.",
        "pmt_breakdown": {
          "process": "Participants can evaluate decisions and define overarching decision-making processes that facilitate traceable and sustainable decisions across the organization.",
          "method": "Participants can introduce and train others on decision support methods. They can establish best practices for decision documentation and rationale capture.",
          "tool": "Participants are able to set up and optimize decision tracking tools for the organization. They can establish templates and guidelines for tool usage."
        }
      }
    },
    "Information Management": {
      "1": {
        "unified": "The participant knows the advantages of established information and knowledge management. They are aware of documentation methods and that information management platforms exist.",
        "pmt_breakdown": {
          "process": "The participant knows the advantages of established information and knowledge management processes within systems engineering.",
          "method": "The participant knows that structured methods exist for organizing, categorizing, and sharing information and knowledge.",
          "tool": "The participant knows that platforms and tools exist for information management and knowledge transfer."
        }
      },
      "2": {
        "unified": "The participant knows the main platforms for knowledge transfer and understands which information needs to be documented. They can navigate information management tools to find and access documentation.",
        "pmt_breakdown": {
          "process": "The participant understands the information management process and knows which information needs to be documented and when.",
          "method": "The participant knows different methods for knowledge transfer (e.g., documentation standards, lessons learned, knowledge bases) and understands their application.",
          "tool": "The participant can navigate and use the main platforms for knowledge transfer to find and access project documentation."
        }
      },
      "4": {
        "unified": "The participant can define filing structures for projects, apply documentation methods effectively, and maintain and provide project information independently using appropriate tools.",
        "pmt_breakdown": {
          "process": "The participant can define and implement filing structures for projects. They can ensure proper information flow and documentation within their scope.",
          "method": "The participant can apply documentation methods and knowledge transfer techniques. They can create structured documentation following established standards.",
          "tool": "The participant can independently maintain and provide project information using information management platforms. They can set up project spaces and manage access."
        }
      },
      "6": {
        "unified": "The participant can define a comprehensive information management process, establish documentation methods and standards, and set up the information management toolchain for the organization.",
        "pmt_breakdown": {
          "process": "The participant can define a comprehensive information management process for the organization. They can establish governance for information handling and knowledge retention.",
          "method": "The participant can introduce and establish documentation methods and knowledge transfer practices company-wide. They can train others on best practices.",
          "tool": "The participant is able to set up and optimize information management platforms for the organization. They can establish templates, taxonomies, and access structures."
        }
      }
    },
    "Configuration Management": {
      "1": {
        "unified": "The participant understands the necessity of configuration management and knows in which tools configuration items are to be created.",
        "pmt_breakdown": {
          "process": "The participant understands the necessity of configuration management.",
          "tool": "The participant knows in which tools configuration items are to be created."
        }
      },
      "2": {
        "unified": "The participant understands the procedure for defining configuration items. They can recognize relevant configuration items and create a complete configuration for their scopes using the appropriate tools.",
        "pmt_breakdown": {
          "process": "The participant understands the procedure for defining configuration items. They can recognize the configuration items relevant to them and create a complete configuration for their scopes.",
          "tool": "The participant is able to use the tool(s) for their scopes."
        }
      },
      "4": {
        "unified": "The participant can define meaningful configuration items and recognize the items relevant to them. They can carry out changes to the configuration under controlled conditions and set up version control.",
        "pmt_breakdown": {
          "process": "The participant can define meaningful configuration items. They can recognize the configuration items relevant to them. They can carry out changes to the configuration under controlled conditions.",
          "tool": "The participant is able to set up version control for their project."
        }
      },
      "6": {
        "unified": "The participant is able to recognize all relevant configuration items and build a complete configuration across all items. They can identify improvements, propose solutions, support others, and set up the relevant tool landscape.",
        "pmt_breakdown": {
          "process": "The participant is able to recognize all relevant configuration items and build a complete configuration. They can identify improvements, propose solutions, and support others in forming configurations.",
          "tool": "The participant is able to set up the relevant tool landscape for configuration management in the company."
        }
      }
    },
    "Requirements Definition": {
      "1": {
        "unified": "Participants can differentiate between requirements types and understand their interactions. They know the basic requirements management process and that tools exist for this purpose.",
        "pmt_breakdown": {
          "process": "Participants can differentiate between requirements, stakeholder requirements, system requirements and sub-system requirements and understand their interactions.",
          "method": "The participants know the different processes of requirements management and are able to derive user/customer requirements.",
          "tool": "The participant knows how to create a requirements table."
        }
      },
      "2": {
        "unified": "Participants understand how requirements sources are identified and requirements are derived. They know different requirements formats and can read requirements in a database.",
        "pmt_breakdown": {
          "process": "Participants understand how requirements sources are identified, how requirements are derived from sources, and how system requirements are passed on to subsystems.",
          "method": "Participants know and understand how and when different requirements formats are used efficiently (text vs. spreadsheet vs. database).",
          "tool": "Participants can read requirements in a database."
        }
      },
      "4": {
        "unified": "Participants can independently identify requirements sources, derive requirements, and transfer system requirements to subsystems. They can formulate requirements correctly and work independently in a requirements database.",
        "pmt_breakdown": {
          "process": "Participants can independently identify sources of requirements, derive requirements from them, and transfer system requirements to subsystem requirements.",
          "method": "Participants are able to formulate requirements correctly (e.g., using quality criteria) and find an efficient methodology for eliciting requirements.",
          "tool": "The participants are able to create, edit and extend requirements in a requirements database independently."
        }
      },
      "6": {
        "unified": "Participants are able to recognize shortcomings in the process and develop suggestions for improvement. They can guide colleagues in requirements formulation and introduce requirements tools to the enterprise.",
        "pmt_breakdown": {
          "process": "Participants are able to recognize shortcomings in the process and develop suggestions for improvement. They can guide and evaluate the requirements processes.",
          "method": "The participant is able to use and introduce all relevant requirements methods in the company and guide colleagues in the formulation of requirements.",
          "tool": "Participants are able to bring requirements tools into the enterprise and guide colleagues in setting up requirements in the tool. They can introduce new tools or improve existing ones."
        }
      }
    },
    "System Architecting": {
      "1": {
        "unified": "Participants know the purpose of architecture models and can categorize them. They know that dedicated methodologies, modeling languages, and tools exist for architecture modeling.",
        "pmt_breakdown": {
          "process": "The participants know the purpose of architecture models. They can roughly categorize them and understand which problems they solve.",
          "method": "The participant knows the various processes of system architecture (logical and physical architectures).",
          "tool": "The participants know SysML and are able to understand simple representations."
        }
      },
      "2": {
        "unified": "Participants understand why architecture models are relevant as inputs and outputs of the process. They can read architecture models, extract information, and view them in tools.",
        "pmt_breakdown": {
          "process": "Participants understand why architecture models are relevant as inputs and outputs of the process step and why the architecture is relevant as a design guideline for the system.",
          "method": "The participant understands the various processes of system architecture (logical and physical architectures). They can derive the architecture of a system from its requirements.",
          "tool": "The participants can read and understand SysML notations."
        }
      },
      "4": {
        "unified": "Participants know the relevant process steps and can understand architecture development at system and subsystem level. They can independently develop a traceable system architecture and build various SysML diagrams.",
        "pmt_breakdown": {
          "process": "Participants know the relevant process steps for architecture models and know where their inputs come from and where the outputs must go. They can understand architecture development at system and subsystem level.",
          "method": "The participant is able to independently develop a system architecture. The system architecture is traceable from the requirements.",
          "tool": "The participants are able to build various SysML diagrams themselves."
        }
      },
      "6": {
        "unified": "Participants can recognize shortcomings in the process and develop suggestions for improvement. They can create and manage high-complexity models and set up the toolchain for system modeling.",
        "pmt_breakdown": {
          "process": "Participants are able to recognize shortcomings in the process and develop suggestions for improvement.",
          "method": "The participant is able to use and introduce all relevant architecture development methods in the company.",
          "tool": "The participants are able to set up and/or optimize the toolchain for system modeling in the company."
        }
      }
    },
    "Integration, Verification, Validation": {
      "1": {
        "unified": "The participant knows the objectives of verification and validation and knows different types and procedures. They are aware of test planning methods and that test management tools exist.",
        "pmt_breakdown": {
          "process": "The participant knows the objectives of verification and validation. They understand the difference between integration, verification, and validation activities in the development process.",
          "method": "The participant knows different types of testing procedures (e.g., unit testing, integration testing, system testing) and verification approaches.",
          "tool": "The participant knows that test management tools and simulation environments exist for test planning and execution."
        }
      },
      "2": {
        "unified": "The participant can read and understand test plans, test cases and test results. They understand how testing fits into the development process and can use test management tools to view test documentation.",
        "pmt_breakdown": {
          "process": "The participant understands how verification and validation activities are integrated into the development process. They can follow the test workflow from planning to execution to reporting.",
          "method": "The participant can read and understand test plans, test cases, and test results. They understand different testing methods and when each is appropriate.",
          "tool": "The participant can navigate test management tools to view test documentation, test cases, and test results."
        }
      },
      "4": {
        "unified": "The participant can create test plans and define test cases. They are able to carry out tests and simulations, document results, and trace test coverage to requirements.",
        "pmt_breakdown": {
          "process": "The participant can create test plans that align with the verification and validation process. They can trace test coverage to requirements and ensure proper test sequencing.",
          "method": "The participant can define appropriate test cases using suitable testing methods. They can carry out tests and simulations and document results according to established standards.",
          "tool": "The participant can independently use test management tools to create test cases, execute tests, and generate test reports."
        }
      },
      "6": {
        "unified": "The participant is able to set up a test strategy and test plans at an early stage, conduct design reviews, and establish verification and validation processes. They can optimize the test tool landscape for the organization.",
        "pmt_breakdown": {
          "process": "The participant is able to set up a comprehensive test strategy early in development. They can plan and conduct design reviews and establish V&V processes across the organization.",
          "method": "The participant can define and introduce verification and validation methods in the company. They can guide colleagues in test planning and review methodologies.",
          "tool": "The participant is able to set up and optimize the test management toolchain for the organization. They can introduce new tools and establish tool usage guidelines."
        }
      }
    },
    "Operation and Support": {
      "1": "The participants know the aspects of the operation, service and maintenance phase. They know that these are considered during development and that there are activities in the respective phase.",
      "2": "Participants understand how the operation, service and maintenance phases are taken into account in the development of a system. They understand the need for redundancy in the design.",
      "4": "Participants understand how the operation, service and maintenance phases are taken into account in system development. They can develop concepts and systems that ensure the availability of the system.",
      "6": "Participants are able to define the organizational processes for operations, service and maintenance and place them in the context of the entire life cycle."
    },
    "Agile Methods": {
      "1": {
        "unified": "The participant knows the agile values and the relevant agile methods.",
        "pmt_breakdown": {
          "method": "The participant knows the agile values and the relevant agile methods."
        }
      },
      "2": {
        "unified": "The participant understands the basics of agile working methods and how agile methods can be used in their work.",
        "pmt_breakdown": {
          "method": "The participant understands the basics of agile working methods and how agile methods can be used in their work."
        }
      },
      "4": {
        "unified": "The participant can work in an agile environment. They are able to apply the necessary methods.",
        "pmt_breakdown": {
          "method": "The participant can work in an agile environment. They are able to apply the necessary methods."
        }
      },
      "6": "The participant can define and implement the relevant agile methods for a project. They are able to teach and introduce agile methods to others in the company."
    }
  }
}